def p1():
    a = input("Введите пароль")
    if input("Введите пароль ещё раз") == a:
        print("Пароль принят")
    else:
        print("Пароль не принят")

def p2():
    a = int(input("Введите номер вашего места"))
    if a % 2 == 0 and a < 54:
        print ("Верхнее место")
    elif a % 3 == 0 and a % 2 != 0 and a <= 54:
        print ("Боковое место")
    elif a % 2 != 0 and a < 54:
        print ("Нижнее место")
    else:
        print("Купе-место")

def p3():
    a = int(input("Введите год"))
    if a % 4 == 0 and a % 100 != 0 or a % 400 == 0:
        print ("Год", a, "високосный")
    else:
        print ("Это год не високосный")

def p4():
    a = input("Первый цвет ")
    b = input("Второй цвет")
    if (a == "красный" and b == "синий") or (a == "синий" and b == "красный"):
        print("Фиолетовый цвет")
    if (a == "красный" and b == "желтый") or (a == "желтый" and b == "красный"):
        print("Оранжевый цвет")
    if (a == "синий" and b == "желтый") or (a == "желтый" and b == "синий"):
        print("Зелёный цвет")
    else:
        print("Нельзя смешать эти цвета")
p1()
p2()
p3()
p4()